# SetDropShadowData

## Description
```pascal
PROCEDURE SetDropShadowData(
				h           : HANDLE;
				nUnits      : INTEGER;
				dOffset     : REAL;
				dBlurRadius : REAL;
				dAngle      : REAL;
				nOpacity    : INTEGER;
				color       : LONGINT);
```

```python

def vs.SetDropShadowData(h, nUnits, dOffset, dBlurRadius, dAngle, nOpacity, color):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE||
|nUnits|INTEGER||
|dOffset|REAL||
|dBlurRadius|REAL||
|dAngle|REAL||
|nOpacity|INTEGER||
|color|LONGINT||

## Version
Availability: from Vectorworks 2017
## Category
* Object Attributes